app/Controllers/Siswa.php

    public function UpdateData($id_siswa)
    {
        $siswaModel = new ModelSiswa();
        $userModel  = new ModelUser();

        $nisn           = $this->request->getPost('nisn');
        $nama_siswa     = $this->request->getPost('nama_siswa');
        $id_kelas       = $this->request->getPost('id_kelas');
        $id_tahun_ajaran= $this->request->getPost('id_tahun_ajaran');
        $password       = $this->request->getPost('password');

        // Update tbl_siswa
        $siswaModel->update($id_siswa, [
            'nisn' => $nisn,
            'nama_siswa' => $nama_siswa,
            'id_kelas' => $id_kelas,
            'id_tahun_ajaran' => $id_tahun_ajaran,
        ]);

        // Siapkan data update untuk tbl_user
        $userUpdate = [
            'nisn' => $nisn,
        ];

        // Jika password tidak kosong, hash dan update
        if (!empty($password)) {
            $userUpdate['password'] = sha1($password);
        }

        // Update berdasarkan id_siswa (foreign key)
        $userModel->where('id_siswa', $id_siswa)->set($userUpdate)->update();
---
UPDATE `tbl_siswa` SET `nisn` = '0091913713', `nama_siswa` = 'Agit Sutrisno aja', `id_kelas` = '2', `id_tahun_ajaran` = '4'
WHERE `tbl_siswa`.`id_siswa` IN ('2')
UPDATE `tbl_user` SET `nisn` = '0091913713'
WHERE `id_siswa` = '2'

    public function DeleteData($id_siswa)
    {
        $userModel  = new ModelUser();
        $siswaModel = new ModelSiswa();

        // Hapus user yang terhubung ke siswa
        $userModel->where('id_siswa', $id_siswa)->delete();

        // Hapus data siswa
        $siswaModel->delete($id_siswa);
---
DELETE FROM `tbl_user`
WHERE `id_siswa` = '1'
DELETE FROM `tbl_siswa`
WHERE `id_siswa` IN ('1')