app/Models/ModelTransaksipembayaran.php

    public function AllData()
    {
        return $this->db->table('tbl_transaksi_pembayaran')
            ->join('tbl_user', 'tbl_user.id_user=tbl_transaksi_pembayaran.id_user')
            ->join('tbl_pembayaran', 'tbl_pembayaran.id_pembayaran=tbl_transaksi_pembayaran.id_pembayaran')
            ->join('tbl_siswa', 'tbl_siswa.id_siswa=tbl_pembayaran.id_siswa')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_transaksi_pembayaran`
JOIN `tbl_user` ON `tbl_user`.`id_user`=`tbl_transaksi_pembayaran`.`id_user`
JOIN `tbl_pembayaran` ON `tbl_pembayaran`.`id_pembayaran`=`tbl_transaksi_pembayaran`.`id_pembayaran`
JOIN `tbl_siswa` ON `tbl_siswa`.`id_siswa`=`tbl_pembayaran`.`id_siswa`

    public function DataByNISN($nisn)
    {
        return $this->db->table('tbl_transaksi_pembayaran')
            ->join('tbl_pembayaran', 'tbl_pembayaran.id_pembayaran = tbl_transaksi_pembayaran.id_pembayaran')
            ->join('tbl_siswa', 'tbl_siswa.id_siswa = tbl_pembayaran.id_siswa')
            ->join('tbl_user', 'tbl_user.nisn = tbl_siswa.nisn')
            ->where('tbl_user.nisn', $nisn)
            ->select('tbl_transaksi_pembayaran.*, tbl_user.nama_user, tbl_siswa.nama_siswa')
            ->get()->getResultArray();
---
SELECT `tbl_transaksi_pembayaran`.*, `tbl_user`.`nama_user`, `tbl_siswa`.`nama_siswa`
FROM `tbl_transaksi_pembayaran`
JOIN `tbl_pembayaran` ON `tbl_pembayaran`.`id_pembayaran` = `tbl_transaksi_pembayaran`.`id_pembayaran`
JOIN `tbl_siswa` ON `tbl_siswa`.`id_siswa` = `tbl_pembayaran`.`id_siswa`
JOIN `tbl_user` ON `tbl_user`.`nisn` = `tbl_siswa`.`nisn`
WHERE `tbl_user`.`nisn` = '0091913712'

    public function UpdateData($data)
    {
        $this->db->table('tbl_transaksi_pembayaran')
            ->where('id_transaksi_pembayaran', $data['id_transaksi_pembayaran'])
            ->update($data);
---
UPDATE `tbl_transaksi_pembayaran` SET `id_transaksi_pembayaran` = '1', `bukti_bayar` = '1747746956_7baab0c9771797ae7893.jpg'
WHERE `id_transaksi_pembayaran` = '1'

    public function DetailData($id)
    {
        return $this->db->table('tbl_transaksi_pembayaran')
            ->where('id_transaksi_pembayaran', $id)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_transaksi_pembayaran`
WHERE `id_transaksi_pembayaran` = '1'