app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
WHERE `level` IN (1,2)
---
    public function AllData()
    {
        return $this->db->table('tbl_user')
            ->whereIn('level', [1, 2])
            ->get()
            ->getResultArray();

UPDATE `tbl_user` SET `id_user` = '4', `nama_user` = 'budi aja', `email` = 'budiaja@gmail.com', `level` = '2'
WHERE `id_user` = '4'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_user')
            ->where('id_user', $data['id_user'])
            ->update($data);

DELETE FROM `tbl_user`
WHERE `id_user` = '3'
AND `id_user` = '3'
---
    public function DeleteData($data)
    {
        $this->db->table('tbl_user')
            ->where('id_user', $data['id_user'])
            ->delete($data);

SELECT *
FROM `tbl_user`
WHERE `email` = 'tatausaha@gmail.com'
AND `password` = '88ea39439e74fa27c09a4fc0bc8ebe6d00978392'
---
    public function LoginUser($email, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();

SELECT *
FROM `tbl_user`
WHERE `nisn` = '0091913712'
AND `password` = '88ea39439e74fa27c09a4fc0bc8ebe6d00978392'
AND `level` = 3
---
    public function LoginOrangTua($nisn, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'nisn' => $nisn,
                'password' => $password,
                'level' => 3
            ])->get()->getRowArray();