app/Models/ModelSiswa.php

SELECT *
FROM `tbl_siswa`
JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas`=`tbl_siswa`.`id_kelas`
JOIN `tbl_tahun_ajaran` ON `tbl_tahun_ajaran`.`id_tahun_ajaran`=`tbl_siswa`.`id_tahun_ajaran`
---
    public function AllData()
    {
        return $this->db->table('tbl_siswa')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas=tbl_siswa.id_kelas')
            ->join('tbl_tahun_ajaran', 'tbl_tahun_ajaran.id_tahun_ajaran=tbl_siswa.id_tahun_ajaran')
            ->get()
            ->getResultArray();