app/Models/ModelTahunajaran.php

SELECT *
FROM `tbl_tahun_ajaran`
---
    public function AllData()
    {
        return $this->db->table('tbl_tahun_ajaran')
            ->get()
            ->getResultArray();