app/Models/ModelOrangtua.php

SELECT COUNT(*) AS `numrows` FROM `tbl_kelas`
---
    public function JumlahKelas()
    {
        return $this->db->table('tbl_kelas')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_siswa`
---
    public function JumlahSiswa()
    {
        return $this->db->table('tbl_siswa')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_pembayaran`
---
    public function JumlahPembayaran()
    {
        return $this->db->table('tbl_pembayaran')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_transaksi_pembayaran`
---
    public function JumlahTransaksiPembayaran()
    {
        return $this->db->table('tbl_transaksi_pembayaran')->countAll();