app/Models/ModelPembayaran.php

    public function AllData()
    {
        return $this->db->table('tbl_pembayaran')
            ->join('tbl_siswa', 'tbl_siswa.id_siswa=tbl_pembayaran.id_siswa')
            ->join('tbl_tahun_ajaran', 'tbl_tahun_ajaran.id_tahun_ajaran=tbl_pembayaran.id_tahun_ajaran')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_pembayaran`
JOIN `tbl_siswa` ON `tbl_siswa`.`id_siswa`=`tbl_pembayaran`.`id_siswa`
JOIN `tbl_tahun_ajaran` ON `tbl_tahun_ajaran`.`id_tahun_ajaran`=`tbl_pembayaran`.`id_tahun_ajaran`

    public function UpdateData($data)
    {
        $this->db->table('tbl_pembayaran')
            ->where('id_pembayaran', $data['id_pembayaran'])
            ->update($data);
---
UPDATE `tbl_pembayaran` SET `id_pembayaran` = '1', `id_siswa` = '6', `id_tahun_ajaran` = '5', `jumlah_tagihan` = '150000', `status` = '2', `tgl_jatuh_tempo` = '2025-05-19'
WHERE `id_pembayaran` = '1'